Repository: thawhyte/IdentityServer
Catalog: Admin_NIBSS/TheCoreBanking.Authenticate/Resources/Views.Home.Index.*.resx
Languages: fr

source: Administrative operations
fr: Opérations administratives

source: Approval
fr: Approbation

source: Approval processing
fr: Processus d'approbation

source: Approve Operations
fr: Approuver les opérations

source: Approving transactions
fr: Approbation des transactions

source: Bank account configuration
fr: Configuration du compte bancaire

source: Check Report
fr: Rapport de vérification

source: Company
fr: Entreprise

source: Complete documentation
fr: Documentation complète

source: Credit
fr: Crédit

source: Credit processing
fr: Traitement de crédit

source: Customers
fr: Les clients

source: Finance
fr: La finance

source: Generate reports
fr: Générer des rapports

source: Investment
fr: Investissement

source: Ledger maintenance
fr: Maintenance du grand livre

source: Limitless Banking Experience.
fr: Expérience bancaire sans limites.

source: Maintain Profiled Customers
fr: Maintenir les clients profilés

source: Manage Customers
fr: Gérer les clients

source: Other investments
fr: Autres investissements

source: Other related operations
fr: Autres opérations connexes

source: Process Credit
fr: Crédit de processus

source: Profile Customers
fr: Profil Clients

source: Reports
fr: Rapports

source: Retail
fr: Vente au détail

source: Retail banking
fr: La Banque de détail

source: Setup bank
fr: banque mise en place

source: Setup banking entities
fr: Configurer des entités bancaires

source: Setup Ledger
fr: Ledger d'installation

source: Start Investment
fr: Commencer l'investissement

source: Start Operation
fr: Commencer l'opération

source: The Core Banking 2.0
fr: Le noyau bancaire 2.0

source: Treasury operations
fr: Opérations de trésorerie

source: View reports
fr: Voir les rapports
